In [34]:
import numpy as np
import pandas as pd

In [35]:
df = pd.DataFrame(np.random.randn(5,4), 'A B C D E'.split(), 'W X Y Z'.split())
df

          W         X         Y         Z
A -0.766122  1.668665 -1.489085 -0.674075
B  0.154949 -1.164152  1.413531 -0.673541
C  0.370058 -1.245488  0.123647 -0.729149
D -0.848884  0.689639  0.041295  0.878564
E -0.262630  0.110374  1.414212 -0.762090

# Reset Index

In [36]:
#turn original index into a new column, new index is numerical
df.reset_index()    #won't effect df unless inplace=True

  index         W         X         Y         Z
0     A -0.766122  1.668665 -1.489085 -0.674075
1     B  0.154949 -1.164152  1.413531 -0.673541
2     C  0.370058 -1.245488  0.123647 -0.729149
3     D -0.848884  0.689639  0.041295  0.878564
4     E -0.262630  0.110374  1.414212 -0.762090

In [43]:
df['Names'] = 'Arthur Bill Charles David Evan'.split()
df

          W         X         Y         Z    Names
A -0.766122  1.668665 -1.489085 -0.674075   Arthur
B  0.154949 -1.164152  1.413531 -0.673541     Bill
C  0.370058 -1.245488  0.123647 -0.729149  Charles
D -0.848884  0.689639  0.041295  0.878564    David
E -0.262630  0.110374  1.414212 -0.762090     Evan

# Rename Index

In [45]:
df.index.names
df

          W         X         Y         Z    Names
A -0.766122  1.668665 -1.489085 -0.674075   Arthur
B  0.154949 -1.164152  1.413531 -0.673541     Bill
C  0.370058 -1.245488  0.123647 -0.729149  Charles
D -0.848884  0.689639  0.041295  0.878564    David
E -0.262630  0.110374  1.414212 -0.762090     Evan

In [48]:
df.index = ['a', 'b','c','d','e']
df

          W         X         Y         Z    Names
a -0.766122  1.668665 -1.489085 -0.674075   Arthur
b  0.154949 -1.164152  1.413531 -0.673541     Bill
c  0.370058 -1.245488  0.123647 -0.729149  Charles
d -0.848884  0.689639  0.041295  0.878564    David
e -0.262630  0.110374  1.414212 -0.762090     Evan

# Multi-level Index

In [54]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [55]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [56]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [58]:
df = pd.DataFrame(np.random.randn(6,2), hier_index, ['A', 'B'])
df

             A         B
G1 1 -0.572405 -1.027814
   2  0.650228  1.789083
   3  0.750840  0.963850
G2 1  0.898511  1.518278
   2  0.561697  0.166721
   3 -0.757211  1.474599

In [10]:
df

             A         B
G1 1  0.122947 -0.368348
   2 -0.519105  0.326891
   3 -0.680412 -0.411450
G2 1  0.442413  0.902413
   2  1.051198 -0.645323
   3  0.410896  0.008533

In [60]:
df.loc['G1'].loc[2]

A    0.650228
B    1.789083
Name: 2, dtype: float64

In [61]:
df['A']

G1  1   -0.572405
    2    0.650228
    3    0.750840
G2  1    0.898511
    2    0.561697
    3   -0.757211
Name: A, dtype: float64

In [62]:
df.iloc[3]

A    0.898511
B    1.518278
Name: (G2, 1), dtype: float64

In [63]:
df.loc['G1', 3]['B']

0.9638497840792132

# Rename Index

In [64]:
df.index.names = ['Group', 'Num']

In [65]:
df.index.names

FrozenList(['Group', 'Num'])

In [66]:
df

                  A         B
Group Num
G1    1   -0.572405 -1.027814
      2    0.650228  1.789083
      3    0.750840  0.963850
G2    1    0.898511  1.518278
      2    0.561697  0.166721
      3   -0.757211  1.474599

# Cross-Section

In [27]:
df.xs('G1')

            A         B
Num
1    0.122947 -0.368348
2   -0.519105  0.326891
3   -0.680412 -0.411450

In [29]:
df.xs(1, level='Num')

              A         B
Group
G1     0.122947 -0.368348
G2     0.442413  0.902413

In [30]:
df.xs('B', axis=1)

Group  Num
G1     1     -0.368348
       2      0.326891
       3     -0.411450
G2     1      0.902413
       2     -0.645323
       3      0.008533
Name: B, dtype: float64